tap "d12frosted/emacs-plus"
tap "dagger/tap"
tap "dotenvx/brew"
tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "nikitabobko/tap"
tap "supabase/tap"
# Asciicast to GIF converter
brew "agg"
# Record and share terminal sessions
brew "asciinema"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Official Amazon AWS command-line interface
brew "awscli"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# YAML Parser
brew "libyaml"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Configurable static site generator
brew "hugo"
# Display an interface's bandwidth usage
brew "iftop"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq", link: true
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pretty system information tool written in Rust
brew "pfetch-rs"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Test your LLM app locally
brew "promptfoo"
# Parse HTML at the command-line
brew "pup"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Command-line tool for Stripe
brew "stripe-cli"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Collection of Linux utilities
brew "util-linux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-modern-black-dragon-icon", "with-xwidgets"]
# Dagger is an integrated platform to orchestrate the delivery of applications
brew "dagger/tap/dagger"
# Secure dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Supabase CLI
brew "supabase/tap/supabase"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Chromium based browser
cask "arc"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Containerized environments for coding agents
cask "container-use"
# Write, edit, and chat about your code with AI
cask "cursor"
# Translate words without ever opening a dictionary
cask "dictionaries"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-hack"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
# Web browser
cask "google-chrome"
# Virtual globe
cask "google-earth-pro"
# AI-powered notepad for meetings
cask "granola"
# Classical music streaming app
cask "idagio"
# System monitoring app
cask "istat-menus"
# Native app email client for Gmail
cask "mimestream"
# Run LLMs locally
cask "msty"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Podcast platform
cask "pocket-casts"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Messaging app with a focus on speed and security
cask "telegram"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "anthropic.claude-code"
vscode "anysphere.remote-containers"
vscode "astro-build.astro-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hverlin.mise-vscode"
vscode "iganbold.superdesign"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "rooveterinaryinc.roo-cline"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "tiehuis.zig"
vscode "tomoki1207.pdf"
vscode "vue.volar"
